---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchInElementFailure
source: html/96fda17a-8ee3-c046-f43e-220a5e751100.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchInElementFailure Property

The constraints of the sketch defining the highlighted element cannot be satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId VarSketchInElementFailure { get; }
```